<?php
/**
 * 11000 用户
 * 12000 商品
 * 13000 订单
 * 14000 api
 * 15000 促销&优惠券
 *
 */
return [
    '10000' => '未定义的错误信息',
    '10002' => '没有找到此记录',
    '10003' => '参数不正确',
    '10004' => '保存失败',
    '10005' => '用户信息没有修改',
    '10006' => '图片超过限定张数',
    '10007' => '',
    '10008' => '没有此配置参数',
    '10009' => '没有此消息编码，请确认',
    '10010' => '您没有该操作权限',
    '10011' => '请选择商户',
    '10012' => '验证码错误',
    '10013' => '请输入验证码',
    '10014' => '没有此推荐人',
    '10015' => '商户公众号未配置',
    '10016' => '保存成功',
    '10018' => '新增成功',
    '10019' => '新增失败',
    '10020' => '更新成功',
    '10021' => '更新失败',
    '10022' => '删除成功',
    '10023' => '删除失败',
    '10024' => '获取成功',
    '10025' => '获取失败',
    '10026' => '查询成功',
    '10027' => '查询失败',
    '10028'=>'有非法查询字段',
    '10029'=>'查询字段错误',
    '10030'=>'字段校检通过',
    '10031'=>'排序错误',
    '10032'=>'排序校检通过',
    '10033'=>'无参数相关信息',
    '10034'=>'上传成功',
    '10035'=>'上传失败',
    '10036'=>'没有符合的数据',
    '10037'=>'失败',
    '10038'=>'成功',
    '10039'=>'导出执行失败',
    '10040'=>'导出执行成功',
    '10041'=>'导入执行失败',
    '10042'=>'导入执行成功',
    '10043'=>'请先上传图片',
    '10045'=>'请输入任务名称,防止混淆',
    '10046'=>'导出任务加入成功，请到任务列表中下载文件',
    '10047'=>'导入任务加入成功，请到任务列表中查看进度',
    '10048'=>'请求地址出错',
    '10049'=>'callback参数不合法',

    '10050' => '此支付方式未启用',
    '10051' => '缺少参数，请确认',
    '10052' => '此支付方式未启用，或不是一个有效的支付方式',
    '10053' => '已开启过此支付方式，不需要重复开启',
    '10054' => '没有此支付类型,请确认',
    '10055' => '请选择支付方式',
    '10056' => '请输入支付单号',
    '10057' => '没有此支付方式',
    '10058' => '没有此支付方式，或此支付方式未启用',
    '10059' => '支付单金额为0，直接支付成功',
    '10060' => '没有找到此支付单',
    '10061' => '不需要获取openid',
    '10062' => '请用户先进行微信登陆或绑定',
    '10063' => '请用户先进行支付宝登陆或绑定',
    '10064' => '',
    '10065' => '',
    '10066' => 'msg里的值就是跳转的url',                  //微信公众号静默登陆
    '10067' => '公众号支付必须传url参数',
    '10068' => 'code必传',
    '10069' =>  '后台小程序配置的APPID和APPSECRET错误，无法生成海报',
    '10070'=>'iv参数缺失',
    '10071'=>'加密参数缺失',
    '10072'=>'地址库不存在，请重新生成',
    '10073'=>'未查询到授权信息',
    '10074'=>'清除缓存成功',
    '10075'=>'后台操作日志默认不让删除',
    '10076'=>'时间段格式不正确',
    '10077'=>'没有此时间维度',
    '10078'=>'开始时间必须小于结束时间',
    '10079'=>'没有此时间粒度',


    '10100' => '没有此消息编码',
    //下载
    '10101'=>'下载失败',
    '10102'=>'开始下载',
    '10103'=>'文件不存在',
    '10104'=>'裁剪失败',


    //插件
    '10700'=>'插件不存在',
    '10701'=>'安装成功',
    '10702'=>'安装失败，请重试',
    '10703'=>'卸载成功',
    '10704'=>'卸载失败，请重试',
    '10705'=>'插件信息缺失',
    '10706'=>'插件预安装失败',
    '10707'=>'插件数据库安装失败',
    '10708'=>'获取配置信息',
    '10709'=>'配置信息保存失败',
    '10710'=>'配置信息保存成功',
    '10711'=>'请先安装插件',
    '10712'=>'刷新成功',
    '10713'=>'刷新失败，请重试',
    '10714'=>'停用成功',
    '10715'=>'停用失败，请重试',
    '10716'=>'插件预卸载失败',
    '10717'=>'请先安装快递打印插件',



    '11001'   => '用户未登录',
    '11002'   => '此微信用户未登录或当前账号未绑定微信账号',
    '11003' => '请选择头像',
    '11004' => '没有找到此用户',
    '11005' => '此用户没有绑定手机号码，所以发送短信失败',
    '11006' => '此用户以停用，请联系总管理员',
    '11007' => '余额不足',
    '11008' => '请输入用户名，长度6-20位',
    '11009' => '请输入密码，长度为6-16位',
    '11010' => '没有找到此管理员',
    '11011' => '用户名重复',
    '11012' => '请输入旧密码',
    '11013' => '请输入新密码',
    '11014' => '请输入确认密码',
    '11015' => '用户余额不足',
    '11016' => '没有找到此提现银行卡',
    '11017' => '请输入银行卡号',
    '11018' => '请输入提现金额',
    '11019' => '已注册过，请直接登陆',
    '11020' => '请输入正确的充值金额',
    '11021' => '请检查银行卡号是否有误',
    '11022' => '账号已停用',
    '11023' => '超级管理员，就不要编辑了吧？',
    '11024' => '超级管理员，就不要删除了把？',
    '11025' => '两次密码输入不一致',
    '11026' => '密码过期了',
    '11027' => '用户必须绑定手机号码',        //报此错误的话，必须调用绑定手机号码接口
    '11028' => '手机号码已绑定，请用新手机号码直接登陆',
    '11029'=>'用户数据保存失败',

    '11050' => '没有此收货地址信息',
    '11051' => '请输入手机号码',
    '11055' => '请选择自提门店',
    '11056'=>'用户暂无收货地址',



    '11070' => '请输入角色名称',
    '11071' => '没有此角色信息',
    '11072' => '没有选择权限信息',

    '11080' => '请输入管理员的手机号码',
    '11081' => '没有找到此用户',
    '11082' => '目前一个账号只能绑定一个店铺，此手机号码已注册过店铺，如果是未审核通过的店铺可以联系平台删除对应的店铺，然后再次添加此管理员',
    '11083' => '手机号码和用户id两者最少写一个',
    '11084' => '此账号已经是店铺管理员了，请勿重新设置',
    '11085' => '此账号是超级管理员，不需要添加',
    '11086' => '您不是管理员，请先成为商户管理员或者创建自己的店铺',
    '11087' => '用户绑定了多个商户平台，系统不知道你想登陆哪一个，需要用户去选择',      //严格意义上来说这个不是错误信息
    '11088' => '没有找到控制器，请联系平台管理员',
    '11089' => '没有找到此方法，请联系平台管理员',
    '11090' => '没有找到此方法所对应的关联方法，请联系平台管理员',
    '11091' => '请先清空下级节点',
    '11092' => '核心参数不能为空',
    '11093' => '父节点是模块，当前类型就必须是控制器',
    '11094' => '父节点是控制器，当前类型就必须是方法',
    '11095' => '父节点是根节点，当前类型就必须是模块',
    '11096' => '当前节点已经存在，请勿重复提交',
    '11097' => '设置的父节点可能会陷入死循环',
    '11098' => '设置的父菜单可能陷入死循环',
    '11099' => '如果是控制器节点，菜单节点必须和父节点保持一致',



    '11100' => '购物车商品不能为空，或不是有效的商品',
    '11101' => '父节点可能会陷入死循环',


    '11500' => '店铺不存在，请确认',
    '11501' => '店铺现在处于非正常状态',       //未审核通过或者是到期了
    //商品
    //分类
    '12001'=>'获取顶级分类失败',
    '12002'=>'商品数据保存失败',
    '12003'=>'货品数据保存失败',
    '12004'=>'请选择默认货品',
    '12005'=>'会员价保存失败',
    '12006'=>'商品图片保存失败',
    '12007'=>'扩展分类保存失败',
    '12008'=>'总库存更新失败',
    '12009'=>'商品ID不能为空',
    '12010'=>'商品不存在',
    '12011'=>'属性值不能为空',
    '12012'=>'属性值删除失败',
    '12013'=>'属性值保存失败',
    '12014'=>'商品： {JSHOP1} 已在未结束的活动{JSHOP2}中，请勿重复添加！',

    //品牌
    '12101'=>'',
    //类型
    '12301'=>'',
    //属性
    '12401'=>'',
    //货品
    '12501'=>'货品不存在',

    //商品
    '12701'=>'无此规格信息',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    ''=>'',
    //订单
    '13001' => '请选择收货地址',
    '13002'=>'取消订单成功',
    '13003'=>'取消订单失败',
    '13004'=>'暂未设置配送方式',
    '13005'=>'下单成功',
    '13006'=>'下单失败',
    '13007'=>'已支付',
    '13008'=>'已发货',
    '13009'=>'订单统计',
    '13010'=>'全部',
    '13011'=>'待付款',
    '13012'=>'已付款',
    '13013'=>'财务统计',
    '13014' => '收款单',
    '13015' => '订单收款',
    '13016' => '订单退款',
    '13017' => '充值',
    '13018' =>'提现',


    '13100' => '请输入订单编号',
    '13101' => '没有找到此订单信息,或者您没有权限查看此信息',
    '13102' => '已有售后,请联系客服',
    '13103'=>'订单类型不能为空',

    '13200' => '订单不是可售后状态',
    '13201' => '退货的数量超过可退的数量',
    '13202' => '退货商品不正确，请确认',
    '13203' => '订单状态不可退款',
    '13204' => '订单状态不可退货',
    '13205' => '请选择退货商品',
    '13206' => '总退款金额超过已支付金额',
    '13207' => '售后单不是待审核状态，或者没有找到此售后单',
    '13208' => '退款单金额为0，不需要退款',
    '13209' => '退货数量为空，不需要生成退货单',
    '13210' => '退款单已退或没权限进行操作',
    '13211' => '退货单已退或没权限进行操作',
    '13212' => '请输入退货单编号',
    '13213' => '请选择物流公司',
    '13214' => '请输入物流编码',
    '13215' => '请输入退款单号',
    '13216' => '请输入退款金额',
    '13217' => '请输入售后单号',
    '13218' => '没有找到此售后单',
    '13219' => '没有找到此退款单或此退款单状态不是未待退款状态',
    '13220' => '请输入退货单号',
    '13221' => '没有找到此退货单',
    '13222' => '请输入售后单号',
    '13223' => '没有找到此售后单号',
    '13224' => '没有找到此退款单或此退款单状态不是退款失败状态',
    '13225' => '缺少物流查询参数',
    '13226' => 'x轴最多1000个节点，请减少时间范围，或者修改粒度',
    '13227' => '还没发货呢，怎么能收到货呢？',
    '13228' => '请选择审核状态',
    '13229'=>'快递公司编码不能为空',



    '13300' => '订单已完成或取消不能发货',
    '13301' => '订单未付款不能发货',
    '13302' => '订单已发货不能再发货',
    '13303' => '订单中不存在要发货的商品',
    '13304' => '发货数量大于订单中商品的数量',
    '13305' => '发货单生成出现未知错误',
    '13306' => '发货失败，该货品已不存在',
    '13307' => '发货失败，商品数量不足',
    '13308' => '发货明细里包含订单之外的商品',






    '13400' => '评价缺少商品信息',
    '13401' => '评价缺少订单号',
    '13402' => '评价缺少商家店铺评价信息',
    '13403' => '缺少商品ID参数',

    '13500'=>'请选择配送地区',





    '14001' => '',
    '14002' => 'method参数结构错误',
    '14003' => 'method参数1不存在',
    '14004' => 'method参数2不存在',
    '14006' => '请先登录',
    '14007' => '用户身份过期请重新登录',
    '14008' => '操作失败，请重试1',
    '14009' => '操作失败，请重试2',
    '14011' => '请输入货品id',
    '14012' => '请输入货品数量',
    '14013'=>'移除购物车成功',
    '14014'=>'移除购物车失败',


    //促销，优惠券
    '15001' => '请输入促销名称',
    '15002' => '请输入起止时间',
    '15003' => '请选择促销条件',
    '15004' => '没有找到此促销条件',
    '15005' => '没有找到此促销结果',
    '15006' => '请输入促销ID参数',
    '15007' => '该优惠券不存在或状态不可领取',
    '15008' => '你已领取过了,勿重复领取',
    '15009' => '优惠券号码不存在',
    '15010' => '优惠券还没有到开始时间',
    '15011' => '优惠券已经过期',
    '15012' => '优惠券禁用了，请联系客服',
    '15013' => '优惠券已经使用过了',
    '15014' => '优惠券不符合使用规则',
    '15015' => '同一类优惠券，只能使用一张',
    '15016' => '团购或秒杀只能应用一种促销类型',
    '15017' => '同一个商品只能同时存在一个团购秒杀',
    '15018'=>'没有选择任何优惠券',
    '15019'=>'没有找到此促销记录',
    '15020'=>'优惠券号码不存在',

    //拼团
    '15601' => '还没有到时间',
    '15602' => '已经结束了',
    '15603' => '没有找到此拼团商品',
    '15604' => '请传拼团id',
    // '15605' => '请传商品id',
    '15606' => '请传入订单id或者team_id',
    '15607' => '没有此拼团记录,或不是已经结束',
    '15608' => '参加拼团的商品和下单商品不一致',
    '15609' => '没有找到拼团发起人',
    '15610' => '该商品已超过当前活动最大购买量',
    '15611' => '您已超过该活动最大购买量',

    //微信消息
    '16001'=>'请输入标题',
    '16002'=>'请先填写内容',

    //插件
    '17001' => '插件没有启用或没有此插件',
    '17002' => '插件中没有此控制器',
    '17003' => '插件中没有此接口',

    //砍价
    '17601' => '还没有到时间',
    '17602' => '已经结束了',
    '17603' => '没有找到此砍价商品',
    '17604' => '请传砍价id',
    // '17605' => '请传商品id',
    '17610' => '该商品已超过当前活动最大购买量',
    '17611' => '您已超过该活动最大购买量',
    '17612' => '砍价活动不存在',
    '17613' => '您参与的活动已下单，请勿重复下单',
    '17614' => '您参与的活动已结束',
    '17615' => '您参与的活动已取消',

    '17620'=>'请输入活动名称',
    '17621'=>'请输入活动简介',
    '17622'=>'请选择单规格商品',
    '17623'=>'砍价活动状态错误',
    '17624'=>'请选择活动时间',
    '17625'=>'请输入起始金额',
    '17626'=>'请输入成交金额',
    '17627'=>'请输入最大价',
    '17628'=>'请输入最小价',
    '17629'=>'请输入有效时长',
    '17630'=>'请输入砍价次数',
    '17631'=>'砍价总次数必须大于0',


    //表单
    '18001'=>'表单不存在',
    '18002'=>'表单已过期',
    '18003'=>'您已达到最大提交次数，请忽继续提交。',
    '18004'=>'格式错误，请重新输入',
    '18005'=>'提交失败，请重试',
    '18006'=>'请输入',
    '18007'=>'表单明细提交失败，请重试',



    //20000 后台
    //通用
    '20000'=>'请选择',
    //后台用户
    '20100'=>'已经登录成功，跳转中...',
    '20101'=>'退出成功',


    //30000 前台



];
